import time
import sys
import os

os.system("cls" if os.name == "nt" else "clear")

# สี RGB
colors = [
    (255, 0, 0),
    (255, 127, 0),
    (255, 255, 0),
    (0, 255, 0),
    (0, 255, 255),
    (0, 127, 255),
    (139, 0, 255),
    (255, 0, 255)
]

# เนื้อเพลง
lyrics = [
    ("เก็บเพลงรักนี้ให้เป็นของขวัญ", 3.3),
    ("ให้เธอได้รับได้รู้หัวใจของฉัน", 2.7),
    ("แม้คืนวันจะเปลี่ยนแปลงสักแค่ไหน", 5.2),
    ("แต่ใจของฉันที่รักเธอนั้น", 3.6),
    ("ต่อให้ต้องลงนรกหรือขึ้นสรวงสวรรค์", 3.3),
    ("ฉันก็จะไม่มีวันมอบให้ใคร", 5.1),
    ("จะมีเพียงเธอแค่เพียงคนเดียว", 3.9),
    ("และจะมีแต่เธอ เธอแค่เพียงคนเดียว", 3.2),
    ("และจะเป็นเพียงคนเดียวเสมอไป", 5.2),
    ("ที่ฉันฝากชีวิต ทั้งหมดไว้", 7.1),
    ("โดยไม่มีทางทวงกลับคืน", 4.2),
]

# หัวใจ
heart = r"""
       ❤❤❤     ❤❤❤
    ❤██████❤ ❤██████❤
  ❤██████████████████❤
 ❤████████████████████❤
 ❤████████████████████❤
  ❤██████████████████❤
    ❤██████████████❤
      ❤██████████❤
        ❤██████❤
          ❤❤❤
"""

# แสดงหัวใจสีแดง
print("\033[38;2;255;0;80m")
print(heart)
print("\033[0m")

# ฟังก์ชันพิมพ์สีรุ้ง
def rainbow_print(text, speed):
    for i, char in enumerate(text):
        r, g, b = colors[i % len(colors)]

        sys.stdout.write(
            f"\033[38;2;{r};{g};{b}m{char}\033[0m"
        )
        sys.stdout.flush()

        time.sleep(speed)

    print("\n")

# เล่นเพลง
for line, delay in lyrics:
    speed = delay / len(line)
    rainbow_print(line, speed)

# ข้อความปิด
end_text = "❤ รักคุณเข้าอีกแล้ว ❤"

rainbow_print(end_text, 0.05)

print("\n< Khian Code Gun />")
